
{
    "No Poverty": {
        "reason": "No mention or indication of poverty alleviation, economic empowerment, or related social interventions in the paper.",
        "score": 0.100
    },
    "Zero Hunger": {
        "reason": "No content related to food security, agriculture, or hunger issues is addressed.",
        "score": 0.100
    },
    "Good Health and Well-being": {
        "reason": "No direct references to health outcomes, healthcare data, or wellbeing improvements; data security may indirectly support health data privacy but not specifically addressed.",
        "score": 0.500
    },
    "Quality Education": {
        "reason": "Although cloud computing can support education, the paper does not explicitly address educational access, tools, or learning improvements.",
        "score": 0.300
    },
    "Gender Equality": {
        "reason": "No references to gender issues, equity in access, or empowerment.",
        "score": 0.100
    },
    "Clean Water and Sanitation": {
        "reason": "No discussion regarding water resources, sanitation, or their management.",
        "score": 0.100
    },
    "Affordable and Clean Energy": {
        "reason": "No mention or focus on energy issues, renewable or clean energy technology or policy.",
        "score": 0.100
    },
    "Decent Work and Economic Growth": {
        "reason": "Cloud computing and data security technologies may support economic infrastructure, but the paper does not explicitly address employment or economic growth strategies.",
        "score": 1.500
    },
    "Industry, Innovation and Infrastructure": {
        "reason": "The core topic is shareable keyword search over encrypted data in cloud computing, involving cryptography, privacy, and data security—directly supporting innovation in digital infrastructure and data management.",
        "score": 10.000
    },
    "Reduced Inequalities": {
        "reason": "Data privacy and secure sharing could contribute to reducing digital inequality, but the paper does not explicitly focus on equitable access or inclusion.",
        "score": 3.000
    },
    "Sustainable Cities and Communities": {
        "reason": "No explicit connection to urban sustainability, smart cities, or community development.",
        "score": 0.200
    },
    "Responsible Consumption and Production": {
        "reason": "No references to consumption patterns, waste reduction, or sustainable production methods.",
        "score": 0.100
    },
    "Climate Action": {
        "reason": "No focus on climate change mitigation, adaptation, or environmental data management.",
        "score": 0.100
    },
    "Life Below Water": {
        "reason": "No content linked to marine ecosystems or aquatic resource protection.",
        "score": 0.100
    },
    "Life on Land": {
        "reason": "No discussion on terrestrial ecosystems or biodiversity conservation.",
        "score": 0.100
    },
    "Peace, Justice and Strong Institutions": {
        "reason": "Privacy, data security, and cryptography in cloud computing relate to secure institutions and data governance, supporting strong institutions and justice through secure access control and formal security proofs.",
        "score": 7.500
    },
    "Partnerships for the Goals": {
        "reason": "No explicit mention of multi-stakeholder partnerships or cooperation frameworks targeting the SDGs.",
        "score": 0.200
    }
}

