
{
    "General and reference": {
        "reason": "No references to surveys, bibliographies, or general documentation practices. Focused on technical methods rather than reference material.",
        "score": 0.001
    },
    "Hardware": {
        "reason": "No discussion of physical devices, sensors, or hardware architectures. Focuses solely on algorithmic processing.",
        "score": 0.001
    },
    "Computer systems organization": {
        "reason": "No mention of distributed systems, architectures, or embedded systems. Focus is on document processing algorithms.",
        "score": 0.001
    },
    "Networks": {
        "reason": "Absence of network-related concepts (protocols, routing) in title/abstract/keywords.",
        "score": 0.001
    },
    "Software and its engineering": {
        "reason": "Implementation of a prototype system and algorithmic design ('block-based approach') mentioned in abstract and demonstration",
        "score": 4.000
    },
    "Theory of computation": {
        "reason": "Uses learning-to-rank algorithms but doesn't develop new computational models/theories",
        "score": 4.000
    },
    "Mathematics of computing": {
        "reason": "Statistical evaluation (position error rate metrics) but no advanced mathematical frameworks",
        "score": 1.000
    },
    "Information systems": {
        "reason": "Core focus on document processing ('archival document processing' keyword) and information retrieval through OCR",
        "score": 7.000
    },
    "Security and privacy": {
        "reason": "No security mechanisms, encryption, or privacy-preserving techniques discussed",
        "score": 0.001
    },
    "Human-centered computing": {
        "reason": "No HCI elements, user studies, or interface design aspects in the technical approach",
        "score": 0.001
    },
    "Computing methodologies": {
        "reason": "Central contribution: Combines computer vision ('document layout analysis'), machine learning ('learning-to-rank'), and multimodal representations",
        "score": 10.000
    },
    "Applied computing": {
        "reason": "Direct application to cultural preservation ('heritage preservation' in abstract) and East Asian text processing",
        "score": 7.000
    },
    "Social and professional topics": {
        "reason": "No discussion of ethics, policy, or societal impacts beyond technical preservation",
        "score": 0.001
    }
}

