
{
    "General and reference": {
        "reason": "No mention of reference works, surveys, or cross-computing tools. Focus is on applied OCR/ROD methods rather than general reference topics.",
        "score": 0.001
    },
    "Hardware": {
        "reason": "No discussion of hardware components, architectures, or physical systems. Focus is purely on algorithmic/document processing methods.",
        "score": 0.001
    },
    "Computer systems organization": {
        "reason": "No coverage of computer architectures, embedded systems, or cloud infrastructure. The work focuses on document analysis algorithms rather than system organization.",
        "score": 0.001
    },
    "Networks": {
        "reason": "Absence of networking concepts, protocols, or network-related applications in the paper's content.",
        "score": 0.001
    },
    "Software and its engineering": {
        "reason": "Core contribution involves software techniques (block-based models, learning-to-rank algorithms) and a demonstrated prototype system. Keywords: 'implemented prototype', 'MLP comparison', 'pairwise sorting'.",
        "score": 9.000
    },
    "Theory of computation": {
        "reason": "Applied machine learning (learning-to-rank) rather than theoretical computational models. Moderate relevance due to algorithmic design aspects.",
        "score": 4.000
    },
    "Mathematics of computing": {
        "reason": "No advanced mathematical models or theoretical analysis beyond basic error rate metrics (PER).",
        "score": 0.001
    },
    "Information systems": {
        "reason": "Central focus on document processing pipelines (OCR/ROD) and information extraction. Keywords: 'document layout analysis', 'archival document processing', 'multimodal representation'.",
        "score": 8.500
    },
    "Security and privacy": {
        "reason": "No security-related concepts or privacy-preserving techniques discussed.",
        "score": 0.001
    },
    "Human-centered computing": {
        "reason": "Tangential connection through cultural preservation context, but no direct HCI/user interaction analysis. Keywords: 'cultural preservation', 'post-OCR human labor reduction'.",
        "score": 3.000
    },
    "Computing methodologies": {
        "reason": "Core machine learning methodology (learning-to-rank) and AI techniques for document analysis. Keywords: 'block-based models', 'pairwise sorting', 'multimodal representation'.",
        "score": 9.500
    },
    "Applied computing": {
        "reason": "Direct application to digital humanities and archival processing. Keywords: 'cultural preservation', 'classical Chinese documents', 'archival document processing'.",
        "score": 9.000
    },
    "Social and professional topics": {
        "reason": "No discussion of computing policy, ethics, or educational aspects despite digital humanities context.",
        "score": 0.001
    }
}

