[
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=6917&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "軟體工程",
            "智慧環境與物聯網",
            "Cloud Native系統"
        ],
        "title": "Investigating the Influence of Data Architecture on the Performance of Kubernetes-based Applications",
        "Abstract": "Kubernetes has gained significant importance and popularity as a leading container orchestration platform, facilitating the deployment and management of distributed applications. However, despite its widespread adoption, the exploration of data architecture in the context of Kubernetes-based applications remains limited. The design and configuration of data architecture of a Kubernetes cluster can profoundly impact the overall performance and scalability of applications. This paper aims to investigate the influence of data architecture on the performance of Kubernetes-based applications. By analyzing various aspects of data architecture we aim to understand their impact on crucial performance metrics through a series of experiments and performance evaluations. Specifically, we examine different data architecture configurations and their effects on application performance. The outcomes of this research contribute to enhancing the understanding of the relationship between data architecture and the performance of Kubernetes-based applications, empowering developers and system administrators to make informed decisions when optimizing and designing data architecture for their applications in a Kubernetes environment.",
        "keywords": "container, container orchestration, Kubernetes, storage, data architecture, cloud native systems",
        "Contribution":"Second Author",
        "Number of Authors": 2
        
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=720&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "Sports planning",
            "robot automation",
            "animation simulation",
            "artificial intelligence"
        ],
        "title": "A Data Management Scheme for Effective Walkthrough in Complex Virtual Environments",
        "Abstract": "As the complexity of virtual environments increases, it becomes a critical issue to maintain the quality of a walkthrough experience. In this paper, we propose an effective data management scheme to address this issue in client-server architecture. First, we propose using real-time scene management to manage the computing resources on the client side by reducing the amount of transmitted geometry data. Second, we propose a prioritized most likelihood movement model to prefetch potential future objects based on the user’s current motion intention. Lastly, a hybrid coherence cache model is proposed to take advantages of both the temporal and spatial localities of the walkthrough process. We have done extensive experiments to demonstrate how these techniques can improve the effectiveness of walkthrough in a large virtual environment.",
        "keywords": "Large-scale virtual environment – Spatial data management – Effective walkthrough – Prefetching – Caching",
        "Contribution":"First Author",
        "Number of Authors": 2
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=8838&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "密碼學",
            "資訊安全",
            "多接受者加密",
            "匿名性"
        ],
        "title": "Attribute hiding subset predicate encryption: Quantum-resistant construction with efficient decryption",
        "Abstract":"Predicate encryption is well studied due to its flexibility in supporting fine-grained access control. In Katz et al. (2018) proposed a predicate encryption for a new predicate family, called subset predicate encryption. In such a scheme, a ciphertext and a private key are associated with sets. A private key can successfully decrypt a ciphertext if and only if the set for the private key is a subset of the set for the ciphertext. However, we found that, all the existing schemes are not able to hide the sets associated to ciphertexts, i.e., the information of receivers will be revealed. To enhance the privacy for receivers, we proposed the first subset predicate encryption schemes with weakly attribute hiding. Moreover, our first scheme is constructed over lattices, which is believed to be secure against quantum computers. The security of our scheme is formally proven in the standard model under well-studied complexity assumptions.",
        "keywords":"Attribute-hidingAccess controlSubset predicateQuantum-resistanceLattices",
        "Contribution":"First Author",
        "Number of Authors": 1

    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=7064&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "後量子密碼",
            "現代密碼學",
            "資訊安全",
            "網路安全",
            "區塊鏈技術",
            "隱私保護技術"
        ],
        "title": "A shareable keyword search over encrypted data in cloud computing",
        "Abstract":"Cloud storage is one of the most important applications in our daily lives. User can store their own data into cloud storage and remotely access the saved data. Owing to the social media develops, users can share the digital files to other users, leading to the amount of data growing rapidly and searching abilities necessarily. In the some cases, servers cannot avoid data leakage even if the server provides complete access control. The encrypted data is a best way to resolve this problem but it may eliminate original structure and searching may become impossible. Applying searchable encryption for each receiver may produce messy duplication and occupy the quota of cloud storage from each receiver. User requires keeping their shared documents belonging up to date which are compared with the latest version. To this aim, we thus propose a sharable ID-based encryption with keyword search in cloud computing environment, which enables users to search in data owners’ shared storage while preserving privacy of data. For the performance analysis, we demonstrate the compared resultant with others ID-based or ID-relative encryption. In addition to that, we show the formal proof to verify the security of our proposed.",
        "keywords":"Big Data, Cloud Computing, Data Privacy, Data and Information Security, DNA computing and cryptography, Information Storage and Retrieval",
        "Contribution":"Fifth Author",
        "Number of Authors": 6
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=12398&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "電腦視覺",
            "圖型識別",
            "深度學習",
            "影像分析",
            "多媒體訊號處理"
        ],
        "title": "Mobile Tour Planning Using Landmark Photo Matching and Intelligent Character Recognition",
        "Abstract":"The functionalities of smart phones have extended from basic voice communication to gaming, multimedia entertainment, information retrieval and location-based services. In this paper, we attempt to design a mobile application to assist visitors to have better understandings of popular tourist destinations and related routing information while on tour. The users can obtain descriptions of a specific attraction by simply taking the picture of a landmark photo often shown in the travel booklet using their mobile devices. This is achieved by matching the landmark picture with an image database containing popular tourist spots to locate the interested destination. The location information is further confirmed using techniques in intelligent character recognition. Upon successful identification of the interested location, tourist information regarding this destination, along with the routing details will be delivered using location-based service. We anticipate the proposed mobile application to effectively assist foreign visitors by bringing comprehensive, up-to-date tourist information and promoting better travel experience.",
        "keywords":"Intelligent Character Recognition, Landmark Photo Matching, Mobile Device",
        "Contribution":"Second Author",
        "Number of Authors": 3

    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=6883&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "Computer network",
            "mobile computing",
            "wireless network",
            "digital content"
        ],
        "title": "Message Propagation in DTN Based on Virtual Contact of Behavior Model",
        "Abstract": "Delay Tolerant Network (DTN) is a kind of network structured to deliver message intermittently. Network connections are not persistent between nodes, instead they must rely on nodes making geographic location movements to incur contact with other nodes and establish intermittent communication sessions to allow messages delivery. We will refer to encounters via geographic location movements as “physical contact.” Many DTN researches mainly focus on message delivery via physical contact. However, this paper believes that in a realistic environment, encounters between nodes not only happen geographically in nature, but also occur virtually in cyberspace. When both nodes go online on the same social media platform, it is an encounter we refer as virtual contact. How messages deliver for virtual contact is store-post-and-forward, just like what happens in a DTN, but it is no longer restrained by geographical locations. This paper considers a scenario in which nodes make virtual contact in cyberspace and incur message delivery based on their own behavior patterns. The verifying experiment is conducted using both survey and simulation. First of all, we handed out questionnaires for students to fill out. The questionnaire inquired them to rank their most frequent activities performed on social media platforms. According to the responses, we conclude the top 3 frequent activities when the students use social media platforms and classify them into 3 groups according to a weighted behavior pattern scheme. The classification includes Social Group, Read-Only Group and Interest Group. It does not matter which group a student is assigned to. In the simulation, he or she will get to decide whether to deliver/receive messages or not based on a randomized selection on 3 behavior pattern. Finally, we analyze the simulation result to determine how messages propagated in different behavior pattern groups. It is derived from the simulation that to quicken message propagation, directing messages to one of the behavior groups yields the maximize benefits. This provides the basis for further researches on collecting data of desired scenarios to establish respective propagation models.",
        "keywords":"Delay Tolerant Network, physical contact, virtual contact, behavior pattern",
        "Contribution":"Second Author",
        "Number of Authors": 2
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=6942&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "人工智慧",
            "演算法",
            "數位典藏",
            "地理資訊系統"
        ],
        "title": "Analyzing Personal Happiness from Global Survey and Weather Data: A Geospatial Approach",
        "Abstract":"Past studies have shown that personal subjective happiness is associated with various macro- and micro-level background factors, including environmental conditions, such as weather and the economic situation, and personal health behaviors, such as smoking and exercise. We contribute to this literature of happiness studies by using a geospatial approach to examine both macro and micro links to personal happiness. Our geospatial approach incorporates two major global datasets: representative national survey data from the International Social Survey Program (ISSP) and corresponding world weather data from the National Oceanic and Atmospheric Administration (NOAA). After processing and filtering 55,081 records of ISSP 2011 survey data from 32 countries, we extracted 5,420 records from China and 25,441 records from 28 other countries. Sensitivity analyses of different intervals for average weather variables showed that macro-level conditions, including temperature, wind speed, elevation, and GDP, are positively correlated with happiness. To distinguish the effects of weather conditions on happiness in different seasons, we also adopted climate zone and seasonal variables. The micro-level analysis indicated that better health status and eating more vegetables or fruits are highly associated with happiness. Never engaging in physical activity appears to make people less happy. The findings suggest that weather conditions, economic situations, and personal health behaviors are all correlated with levels of happiness.",
        "keywords": "",
        "Contribution":"Fifth Author",
        "Number of Authors": 6
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=6867&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "Wireless networks",
            "mobile communications",
            "mobile computing",
            "the Internet of Things",
            "artificial intelligence"
        ],
        "title": "Cookie-Cooperative Automatic Repeat Request for Transmission Assistance in VANET",
        "Abstract":"Network quality of VANET (Vehicular Ad-hoc Network) is usually bad due to high mobility, speed variation, driver behavior, traffic density, swarm effect, environment complexity, etc. All these factors frequently change the car-to-car distance resulting in intermittent network disconnection. When disconnection occurs, rebuild routing path will increase transmission time and consume transmission bandwidth. Since the network topology of VANET usually deployed along the roadside, the nearby cars are usually the best candidates to help relay packets. In this paper, we propose a Cookie-Cooperative Automatic Repeat reQues (CCARQ) method to enhance network performance by repairing intermittent broken connections. CCARQ is able to assist in transmission in Network Layer through MAC layer enhancement. Simulations show that CCARQ outperforms both AODV and Bypass-AODV in packet delivery ratio, end-to-end delay, control overhead and goodput.",
        "keywords":"VANET · Cooperative transmission, Automatic Repeat Request (ARQ)",
        "Contribution":"First Author",
        "Number of Authors": 2
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=7064&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "後量子密碼",
            "現代密碼學",
            "資訊安全",
            "網路安全",
            "區塊鏈技術",
            "隱私保護技術"
        ],
        "title": "Intelligence-led response: turning theory into law enforcement practice in cyber security incidents",
        "Abstract":"As the internet grows drastically in scale and density, the number of cyber security incidents investigated by law enforcement agencies (LEAs) is skyrocketing. Criminals may deny committing a crime, but LEAs are hindered in proving it by the limited processing capabilities of human analysis. While initial crime scene investigation emphasises finding actionable intelligence as quickly as possible, lab forensics focuses on reconstructing the case and cross-referencing the evidence to find the truth. Both are critical parts of the investigative response to cyber security incidents. This paper presents a practical digital forensic framework based on ISO/IEC 27043: 2015 activities, intended to handle digital evidence at the crime scene and lessen the caseload burden at the lab. By advocating an intelligence-led response to crime scene investigation and lab forensics, we aim to turn theory into practice for LEAs, supporting the resolution of cyber security incidents and the understanding of what happened. By working through the different processes and activities in practical exercises, we aim to enable LEAs to implement a response strategy for combating cyber crime.",
        "keywords":"digital forensics; ISO/IEC 27043: 2015; intelligence-led response; cyber security; law enforcement.",
        "Contribution":"Third Author",
        "Number of Authors": 3
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=9181&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "社群網絡分析",
            "人機互動",
            "眼動",
            "腦影像",
            "資訊倫理與安全"
        ],
        "title": "The mediating role of sense of virtual community",
        "Abstract": "Purpose : The purpose of this paper is to provide a comprehensive model to illustrate the mediating role of sense of virtual community (SOVC) in virtual communities of practices (VCoPs). The interrelations between social capital and collective action in terms of knowledge contribution in the VCoP context are also examined. Design/methodology/approach : A total of 253 members from the Zclub and Jorsindo, responded to the survey. PLS-SEM path modeling was used to analyze survey data. Findings : Members’ structural capital and cognitive capital both positively and significantly influence members’ SOVC, and, in turn, their SOVC influences relational capital. Research limitations/implications:The study linked two theories, namely, social capital and theory of collective action, to discuss knowledge contribution in VCoPs. Social capital and SOVC have significant and positive effects on knowledge contribution in VCoPs. Practical implications:Knowledge contributions in VCoPs are created through interactions among members, as well as the facilitation resulting from shared visions. Administrators can promote the formation of social-interaction ties in VCoPs to reinforce the formation of social capital and a SOVC. Social implication:Administrators of knowledge-oriented groups must strive to sustain proper levels of SOVC among members to ensure their continued participation in VCoPs. Originality/value:The main objectives of this study were to examine the effects of social capital (structural, cognitive, and relational capitals) on the quality and quantity of knowledge contribution. SOVC was proposed as a mediator in the relationship between structural and/or cognitive capital toward relational capital.",
        "keywords": "Sense of virtual community, Social capital, Collective action, Knowledge contribution",
        "Contribution":"Second Author",
        "Number of Authors": 3
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=8850&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "影像處理",
            "視訊壓縮",
            "機器學習及其應用"
        ],
        "title": "Image Denoising Using Adaptive and Overlapped Average Filtering and Mixed-Pooling Attention Refinement Networks",
        "Abstract": "Cameras are essential parts of portable devices, such as smartphones and tablets. Most people have a smartphone and can take pictures anywhere and anytime to record their lives. However, these pictures captured by cameras may suffer from noise contamination, causing issues for subsequent image analysis, such as image recognition, object tracking, and classification of an object in the image. This paper develops an effective combinational denoising framework based on the proposed Adaptive and Overlapped Average Filtering (AOAF) and Mixed-pooling Attention Refinement Networks (MARNs). First, we apply AOAF to the noisy input image to obtain a preliminarily denoised result, where noisy pixels are removed and recovered. Next, MARNs take the preliminary result as the input and output a refined image where details and edges are better reconstructed. The experimental results demonstrate that our method performs favorably against state-of-the-art denoising methods.",
        "keywords": "image denoising; overlapped averaging; mixed-pooling attention",
        "Contribution":"Fifth Author",
        "Number of Authors": 5
    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=9718&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "醫療資訊",
            "資料探勘",
            "文字探勘",
            "機器學習"
        ],
        "title": "Substantia nigra nigrosome-1 imaging correlates with the severity of motor symptoms in Parkinson's disease",
        "Abstract": "Background:Nigrosome-1 imaging has been used for assisting the diagnosis of Parkinson's disease (PD). We aimed to examine the diagnostic performance of loss of nigrosome-1 in PD and the correlation between the size of the nigrosome-1 and motor severity of PD. Methods:We included 237 patients with PD and 165 controls. The motor severity of PD was assessed with the Unified Parkinson's Disease Rating Scale (UPDRS) part III score and Hoehn-Yahr staging. The 3 or 1.5 Tesla susceptibility-weighted imaging combined with a deep-learning algorithm was applied for detecting the loss and the size of nigrosome-1. Clinical correlations and diagnostic performance of size of nigrosome-1 were also investigated. Results:The mean nigrosome-1 size was significantly smaller in PD patients than in controls (0.06 ± 0.07 cm2 vs. 0.20 ± 0.05 cm2, P < 0.001). The area under the receiver operating characteristic curve (AUC) of the established model showed 0.94 accuracy (95% confidence interval [CI]: 0.87, 1.01, P < 0.01) in differentiating between the PD and control groups. Moreover, the partial loss of nigrosome-1 detected with SWI had an AUC of 0.96 in discriminating early-stage PD from controls (95% CI: 0.88, 1.02, P < 0.001). After adjusting for age, sex, disease duration, and levodopa equivalent daily dose, the estimated size of nigrosome-1 was negatively associated with the UPDRS part III motor score (ρ = −0.433, P < 0.001), but not with Mini-Mental State Examination scores (ρ = 0.006, P = 0.894). Conclusions:The extent of loss and the size of nigrosome-1 may potentially assist in the diagnosis of PD. Nigrosome-1 size reflects the motor severity of PD.",
        "keywords": "",
        "Contribution":"Seventh Author",
        "Number of Authors": 8

    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=9794&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "人工智慧",
            "資料分析與知識探勘",
            "數位人文",
            "計算語言學",
            "自動推理與模型建構"
        ],
        "title": "Detecting reading orders with block-based models for OCR for classical Chinese documents: concepts and demonstrations",
        "Abstract": "Texts, printed or written, are the most important form of cultural preservation. This is true for Chinese studies and many cultures. For this reason, optical character recognition (OCR) is one of the most important tools for heritage preservation. With OCR and reading order detection (ROD), we convert the information in their hard-copy forms to digitized documents, allowing both lasting storage and further analysis. Given a page image, the step of ROD helps us determine the order of the texts on the page. An effective ROD reduces the cost of post-OCR human labor for correction. Rule-based and n-gram models are conceivable and popular techniques for implementing ROD, considering the coordinates and the alternative orders of the individually detected characters. In this paper, we report a block-based approach that does not rely on the n-gram techniques for ROD. Instead, we identified the text blocks, and ordered the blocks based on the ideas of learning-to-rank, and concatenated the texts within the blocks by their orders. We evaluated our approach on the MTHv2 dataset. Experimental results show that our approach achieved impressive results, reducing the position error rate (PER) to 5.4%, compared to 61.7% for heuristic methods and 56.5% for MLP, representing a significant improvement of 91.3% and 90.4%, respectively. Additional experiments show that we could have used less data than one might expect to achieve a satisfactory quality of ROD. We implemented and demonstrated a fully functioning prototype at a recent AAAI conference.  The actual performance of the prototype provides solid evidence of the effectiveness and extensibility of our design to more general contexts, e.g., Japanese texts.",
        "keywords": "Reading order detection, Pairwise sorting, Document layout analysis, Multimodal representation, Archival document processing",
        "Contribution":"Second Author",
        "Number of Authors": 3

    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=9794&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "自然語言處理",
            "知識庫組織與應用",
            "醫學文件處理"
        ],
        "title": "Detecting reading orders with block-based models for OCR for classical Chinese documents: concepts and demonstrations",
        "Abstract": "Texts, printed or written, are the most important form of cultural preservation. This is true for Chinese studies and many cultures. For this reason, optical character recognition (OCR) is one of the most important tools for heritage preservation. With OCR and reading order detection (ROD), we convert the information in their hard-copy forms to digitized documents, allowing both lasting storage and further analysis. Given a page image, the step of ROD helps us determine the order of the texts on the page. An effective ROD reduces the cost of post-OCR human labor for correction. Rule-based and n-gram models are conceivable and popular techniques for implementing ROD, considering the coordinates and the alternative orders of the individually detected characters. In this paper, we report a block-based approach that does not rely on the n-gram techniques for ROD. Instead, we identified the text blocks, and ordered the blocks based on the ideas of learning-to-rank, and concatenated the texts within the blocks by their orders. We evaluated our approach on the MTHv2 dataset. Experimental results show that our approach achieved impressive results, reducing the position error rate (PER) to 5.4%, compared to 61.7% for heuristic methods and 56.5% for MLP, representing a significant improvement of 91.3% and 90.4%, respectively. Additional experiments show that we could have used less data than one might expect to achieve a satisfactory quality of ROD. We implemented and demonstrated a fully functioning prototype at a recent AAAI conference.  The actual performance of the prototype provides solid evidence of the effectiveness and extensibility of our design to more general contexts, e.g., Japanese texts.",
        "keywords": "Reading order detection, Pairwise sorting, Document layout analysis, Multimodal representation, Archival document processing",
        "Contribution":"Second Author",
        "Number of Authors": 3

    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=7326&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "軟體定義網路",
            "區塊鏈",
            "演算法設計與分析"
        ],
        "title": "Leader-Contention-Based User Matching for 802.11 Multiuser MIMO Networks",
        "Abstract":"n multiuser MIMO (MU-MIMO) LANs, the achievable throughput of a client depends on who is transmitting concurrently with it. Existing MU-MIMO MAC protocols, however, enable clients to use the traditional 802.11 contention to contend for concurrent transmission opportunities on the uplink. Such a contention-based protocol not only wastes lots of channel time on multiple rounds of contention but also fails to maximally deliver the gain of MU-MIMO because users randomly join concurrent transmissions without considering their channel characteristics. To address such inefficiency, this paper introduces MIMOMate, a leader-contention-based MU-MIMO MAC protocol that matches clients as concurrent transmitters according to their channel characteristics to maximally deliver the MU-MIMO gain while ensuring all users fairly share concurrent transmission opportunities. Furthermore, MIMOMate elects the leader of the matched users to contend for transmission opportunities using traditional 802.11 CSMA/CA. It hence requires only a single contention overhead for concurrent streams and can be compatible with legacy 802.11 devices. A prototype implementation in USRP N200 shows that MIMOMate achieves an average throughput gain of 1.42× and 1.52× over the traditional contention-based protocol for two- and three-antenna AP scenarios, respectively, and also provides fairness for clients.",
        "keywords":"Multiuser MIMO (MU-MIMO),user matching,channel orthogonality",
        "Contribution":"First Author",
        "Number of Authors": 4

    },
    {
        "url": "https://ah.lib.nccu.edu.tw/scholar?id=1842&locale=en&locale=en",
        "college": "College of Informatics",
        "department": "Department of Computer Science",
        "expertise": [
            "Multimedia systems",
            "data mining",
            "database systems",
            "bioinformatics"
        ],
        "title": "Algorithms for Discovery of Spatial Co-orientation Patterns from Images",
        "Abstract":"Image mining is an important task to discover interesting and meaningful patterns form large image databases. In this paper, we introduce the spatial co-orientation patterns in image databases. Spatial co-orientation patterns refer to objects that frequently occur with the same spatial orientation, e.g. left, right, below, etc. among images. For example, an object P is frequently left to an object Q among images. We utilize the data structure, 2D string, to represent the spatial orientation of objects in an image. Two approaches, Apriori-based and pattern-growth approaches, are proposed for mining co-orientation patterns. An experimental evaluation with synthetic datasets shows the advantage and disadvantage between these two algorithms",
        "keywords":"Spatial co-orientation patterns2D stringIconic imagesSpatial mining",
        "Contribution":"First Author",
        "Number of Authors": 2
    }
]
