
{
    "General and reference": {
        "reason": "Paper focuses on technical protocol design rather than surveys, reference works, or general literature reviews. No mention of historical context or bibliographic analysis.",
        "score": 0.001
    },
    "Hardware": {
        "reason": "Prototype implementation using USRP N200 hardware platform mentioned in evaluation section, but hardware design is not the paper's core contribution.",
        "score": 1.000
    },
    "Computer systems organization": {
        "reason": "Focuses on MU-MIMO system architecture, concurrent transmission scheduling, and prototype implementation aspects ('computer systems organization' concepts).",
        "score": 8.000
    },
    "Networks": {
        "reason": "Core contribution to 802.11 MAC protocols, MU-MIMO network optimization, and CSMA/CA contention mechanisms explicitly mentioned in title/abstract/keywords.",
        "score": 10.000
    },
    "Software and its engineering": {
        "reason": "Protocol implementation details mentioned but not software architecture or engineering principles. Keywords lack software-focused terms.",
        "score": 0.500
    },
    "Theory of computation": {
        "reason": "Algorithm design mentioned in author expertise but paper focuses on practical protocol design rather than theoretical computational models.",
        "score": 0.001
    },
    "Mathematics of computing": {
        "reason": "Channel orthogonality analysis implied in user matching but no explicit mathematical modeling or theoretical analysis presented.",
        "score": 0.500
    },
    "Information systems": {
        "reason": "No relation to database systems, information retrieval, or knowledge management systems.",
        "score": 0.001
    },
    "Security and privacy": {
        "reason": "No security mechanisms, encryption, or privacy-preserving techniques discussed in abstract/keywords.",
        "score": 0.001
    },
    "Human-centered computing": {
        "reason": "Technical network protocol paper without HCI components or user experience considerations.",
        "score": 0.001
    },
    "Computing methodologies": {
        "reason": "No machine learning, simulation, or computational modeling methodologies employed.",
        "score": 0.001
    },
    "Applied computing": {
        "reason": "Applied to wireless communication systems through prototype implementation and performance evaluation.",
        "score": 6.000
    },
    "Social and professional topics": {
        "reason": "No discussion of ethical, economic, or professional practice aspects.",
        "score": 0.001
    }
}

