
{
    "No Poverty": {
        "reason": "No mention or implication of poverty alleviation or related social economic factors in the title, abstract, or keywords.",
        "score": 0.100
    },
    "Zero Hunger": {
        "reason": "No reference to food security, agriculture, or hunger-related issues in any part of the paper information provided.",
        "score": 0.100
    },
    "Good Health and Well-being": {
        "reason": "No direct connection to health, healthcare improvement, or well-being topics is indicated in the paper.",
        "score": 0.100
    },
    "Quality Education": {
        "reason": "The paper focuses on virtual environments and data management for walkthroughs, which could support educational VR applications indirectly, but no explicit focus on education is stated.",
        "score": 2.000
    },
    "Gender Equality": {
        "reason": "No discussion or focus on gender issues or gender equality anywhere in the paper details.",
        "score": 0.100
    },
    "Clean Water and Sanitation": {
        "reason": "No connection to water or sanitation management is evident.",
        "score": 0.100
    },
    "Affordable and Clean Energy": {
        "reason": "The paper does not address energy production, affordability, or clean energy technologies.",
        "score": 0.100
    },
    "Decent Work and Economic Growth": {
        "reason": "While the paper involves computer science and technological innovation, there is no explicit link to economic growth, labor or decent work policies.",
        "score": 1.000
    },
    "Industry, Innovation and Infrastructure": {
        "reason": "Direct relevance through proposing novel data management and computational methods to improve virtual environment walkthroughs, contributing to technological innovation and infrastructure.",
        "score": 8.500
    },
    "Reduced Inequalities": {
        "reason": "No explicit mention or implication of addressing social or economic inequalities through technology or otherwise.",
        "score": 0.100
    },
    "Sustainable Cities and Communities": {
        "reason": "Indirect relevance possible via urban simulation or virtual city walkthroughs, but no explicit indication in the paper.",
        "score": 2.000
    },
    "Responsible Consumption and Production": {
        "reason": "No indication of connection to responsible resource consumption or sustainable production practices.",
        "score": 0.100
    },
    "Climate Action": {
        "reason": "No references to climate change mitigation, adaptation, or related environmental action.",
        "score": 0.100
    },
    "Life Below Water": {
        "reason": "No mention of aquatic environments or marine life topics.",
        "score": 0.100
    },
    "Life on Land": {
        "reason": "No focus on terrestrial ecosystems or biodiversity conservation is seen.",
        "score": 0.100
    },
    "Peace, Justice and Strong Institutions": {
        "reason": "Nothing in the paper that relates to governance, justice, peacekeeping or institution building.",
        "score": 0.100
    },
    "Partnerships for the Goals": {
        "reason": "No indication of multi-stakeholder partnerships or goal-focused collaborations.",
        "score": 0.100
    }
}

