
{
    "No Poverty": {
        "reason": "Course focuses on local revitalization and rural planning which inherently supports poverty reduction through improved local economies.",
        "score": 6.000
    },
    "Zero Hunger": {
        "reason": "No explicit mention or focus on food security or agricultural productivity in course description.",
        "score": 0.100
    },
    "Good Health and Well-being": {
        "reason": "Indirect relevance through promoting well-being by addressing spatial and economic issues in rural communities.",
        "score": 2.500
    },
    "Quality Education": {
        "reason": "Course aims at interdisciplinary learning, field survey, GIS skills, and understanding of local revitalization — direct educational content.",
        "score": 10.000
    },
    "Gender Equality": {
        "reason": "No mention of gender-specific analysis or equality issues within the course framework.",
        "score": 0.100
    },
    "Clean Water and Sanitation": {
        "reason": "No clear reference to water resource or sanitation management in the course objectives.",
        "score": 0.100
    },
    "Affordable and Clean Energy": {
        "reason": "No focus on energy issues or clean energy solutions mentioned.",
        "score": 0.100
    },
    "Decent Work and Economic Growth": {
        "reason": "Course addresses economic aspects of rural revitalization and local industry, supporting decent work and growth concepts.",
        "score": 7.500
    },
    "Industry, Innovation and Infrastructure": {
        "reason": "Focus on rural planning and economic industry aspects with integration of GIS implies infrastructure and innovation applications.",
        "score": 6.000
    },
    "Reduced Inequalities": {
        "reason": "Local revitalization and rural focus may address spatial inequalities, but no explicit focus on social equality measures.",
        "score": 3.000
    },
    "Sustainable Cities and Communities": {
        "reason": "Direct relevance through rural area planning and local community development as the core course topic.",
        "score": 9.000
    },
    "Responsible Consumption and Production": {
        "reason": "No specific mention of resource consumption or production sustainability practices.",
        "score": 0.100
    },
    "Climate Action": {
        "reason": "No explicit mention of climate change mitigation or adaptation actions in course description.",
        "score": 0.100
    },
    "Life Below Water": {
        "reason": "No reference to marine ecosystems or aquatic environment topics.",
        "score": 0.100
    },
    "Life on Land": {
        "reason": "Rural spatial planning and land-use analysis directly ties to sustainable management of terrestrial ecosystems.",
        "score": 7.000
    },
    "Peace, Justice and Strong Institutions": {
        "reason": "No direct discussion on governance, justice, or institutional strengthening in the course.",
        "score": 0.100
    },
    "Partnerships for the Goals": {
        "reason": "Indirectly supports partnerships by integrating interdisciplinary students and school resources, but not explicitly framed as SDG partnership.",
        "score": 1.500
    }
}

